OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87j93.h
extern __at(0x0F72) __sfr LCDDATA12;

typedef union
  {
  struct
    {
    unsigned S00C2              : 1;
    unsigned S01C2              : 1;
    unsigned S02C2              : 1;
    unsigned S03C2              : 1;
    unsigned S04C2              : 1;
    unsigned S05C2              : 1;
    unsigned S06C2              : 1;
    unsigned S07C2              : 1;
    };

  struct
    {
    unsigned SEG0COM2           : 1;
    unsigned SEG1COM2           : 1;
    unsigned SEG2COM2           : 1;
    unsigned SEG3COM2           : 1;
    unsigned SEG4COM2           : 1;
    unsigned SEG5COM2           : 1;
    unsigned SEG6COM2           : 1;
    unsigned SEG7COM2           : 1;
    };

  struct
    {
    unsigned S0C2               : 1;
    unsigned S1C2               : 1;
    unsigned S2C2               : 1;
    unsigned S3C2               : 1;
    unsigned S4C2               : 1;
    unsigned S5C2               : 1;
    unsigned S6C2               : 1;
    unsigned S7C2               : 1;
    };
  } __LCDDATA12bits_t;

extern __at(0x0F72) volatile __LCDDATA12bits_t LCDDATA12bits;

#define _S00C2                  0x01
#define _SEG0COM2               0x01
#define _S0C2                   0x01
#define _S01C2                  0x02
#define _SEG1COM2               0x02
#define _S1C2                   0x02
#define _S02C2                  0x04
#define _SEG2COM2               0x04
#define _S2C2                   0x04
#define _S03C2                  0x08
#define _SEG3COM2               0x08
#define _S3C2                   0x08
#define _S04C2                  0x10
#define _SEG4COM2               0x10
#define _S4C2                   0x10
#define _S05C2                  0x20
#define _SEG5COM2               0x20
#define _S5C2                   0x20
#define _S06C2                  0x40
#define _SEG6COM2               0x40
#define _S6C2                   0x40
#define _S07C2                  0x80
#define _SEG7COM2               0x80
#define _S7C2                   0x80

//==============================================================================


//==============================================================================
//        LCDDATA13 Bits

extern __at(0x0F73) __sfr LCDDATA13;

typedef union
  {
  struct
    {
    unsigned S8C2               : 1;
    unsigned S9C2               : 1;
    unsigned S10C2              : 1;
    unsigned S11C2              : 1;
    unsigned S12C2              : 1;
    unsigned S13C2              : 1;
    unsigned S14C2              : 1;
    unsigned S15C2              : 1;
    };

  struct
    {
    unsigned SEG8COM2           : 1;
    unsigned SEG9COM2           : 1;
    unsigned SEG10COM2          : 1;
    unsigned SEG11COM2          : 1;
    unsigned SEG12COM2          : 1;
    unsigned SEG13COM2          : 1;
    unsigned SEG14COM2          : 1;
    unsigned SEG15COM2          : 1;
    };

  struct
    {
    unsigned S08C2              : 1;
    unsigned S09C2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __LCDDATA13bits_t;

extern __at(0x0F73) volatile __LCDDATA13bits_t LCDDATA13bits;

#define _S8C2                   0x01
#define _SEG8COM2               0x01
#define _S08C2                  0x01
#define _S9C2                   0x02
#define _SEG9COM2               0x02
#define _S09C2                  0x02
#define _S10C2                  0x04
#define _SEG10COM2              0x04
#define _S11C2                  0x08
#define _SEG11COM2              0x08
#define _S12C2                  0x10
#define _SEG12COM2              0x10
#define _S13C2                  0x20
#define _SEG13COM2              0x20
#define _S14C2                  0x40
#define _SEG14COM2              0x40
#define _S15C2                  0x80
#define _SEG15COM2              0x80

//==============================================================================


//==============================================================================
//        LCDDATA14 Bits

extern __at(0x0F74) __sfr LCDDATA14;

typedef union
  {
  struct
    {
    unsigned S16C2              : 1;
    unsigned S17C2              : 1;
    unsigned S18C2              : 1;
    unsigned S19C2              : 1;
    unsigned S20C2              : 1;
    unsigned S21C2              : 1;
    unsigned S22C2              : 1;
    unsigned S23C2              : 1;
    };

  struct
    {
    unsigned SEG16COM2          : 1;
    unsigned SEG17COM2          : 1;
    unsigned SEG18COM2          : 1;
    unsigned SEG19COM2          : 1;
    unsigned SEG20COM2          : 1;
    unsigned SEG21COM2          : 1;
    unsigned SEG22COM2          : 1;
    unsigned SEG23COM2          : 1;
    };
  } __LCDDATA14bits_t;

extern __at(0x0F74) volatile __LCDDATA14bits_t LCDDATA14bits;

#define _S16C2                  0x01
#define _SEG16COM2              0x01
#define _S17C2                  0x02
#define _SEG17COM2              0x02
#define _S18C2                  0x04
#define _SEG18COM2              0x04
#define _S19C2                  0x08
#define _SEG19COM2              0x08
#define _S20C2                  0x10
#define _SEG20COM2              0x10
#define _S21C2                  0x20
#define _SEG21COM2              0x20
#define _S22C2                  0x40
#define _SEG22COM2              0x40
#define _S23C2                  0x80
#define _SEG23COM2              0x80

//==============================================================================


//==============================================================================
//        LCDDATA15 Bits

extern __at(0x0F75) __sfr LCDDATA15;

typedef union
  {
  struct
    {
    unsigned S24C2              : 1;
    unsigned S25C2              : 1;
    unsigned S26C2              : 1;
    unsigned S27C2              : 1;
    unsigned S28C2              : 1;
    unsigned S29C2              : 1;
    unsigned S30C2              : 1;
    unsigned S31C2              : 1;
    };

  struct
    {
    unsigned SEG24COM2          : 1;
    unsigned SEG25COM2          : 1;
    unsigned SEG26COM2          : 1;
    unsigned SEG27COM2          : 1;
    unsigned SEG28COM2          : 1;
    unsigned SEG29COM2          : 1;
    unsigned SEG30COM2          : 1;
    unsigned SEG31COM2          : 1;
    };
  } __LCDDATA15bits_t;

extern __at(0x0F75) volatile __LCDDATA15bits_t LCDDATA15bits;

#define _S24C2                  0x01
#define _SEG24COM2              0x01
#define _S25C2                  0x02
#define _SEG25COM2              0x02
#define _S26C2                  0x04
#define _SEG26COM2              0x04
#define _S27C2                  0x08
#define _SEG27COM2              0x08
#define _S28C2                  0x10
#define _SEG28COM2              0x10
#define _S29C2                  0x20
#define _SEG29COM2              0x20
#define _S30C2                  0x40
#define _SEG30COM2              0x40
#define _S31C2                  0x80
#define _SEG31COM2              0x80

//==============================================================================


//==============================================================================
//        LCDDATA16 Bits

extern __at(0x0F76) __sfr LCDDATA16;

typedef union
  {
  struct
    {
    unsigned S32C2              : 1;
    unsigned S33C2              : 1;
    unsigned S34C2              : 1;
    unsigned S35C2              : 1;
    unsigned S36C2              : 1;
    unsigned S37C2              : 1;
    unsigned S38C2              : 1;
    unsigned S39C2              : 1;
    };

  struct
    {
    unsigned SEG32COM2          : 1;
    unsigned SEG33COM2          : 1;
    unsigned SEG34COM2          : 1;
    unsigned SEG35COM2          : 1;
    unsigned SEG36COM2          : 1;
    unsigned SEG37COM2          : 1;
    unsigned SEG38COM2          : 1;
    unsigned SEG39COM2          : 1;
    };
  } __LCDDATA16bits_t;

extern __at(0x0F76) volatile __LCDDATA16bits_t LCDDATA16bits;

#define _S32C2                  0x01
#define _SEG32COM2              0x01
#define _S33C2                  0x02
#define _SEG33COM2              0x02
#define _S34C2                  0x04
#define _SEG34COM2              0x04
#define _S35C2                  0x08
#define _SEG35COM2              0x08
#define _S36C2                  0x10
#define _SEG36COM2              0x10
#define _S37C2                  0x20
#define _SEG37COM2              0x20
#define _S38C2                  0x40
#define _SEG38COM2              0x40
#define _S39C2                  0x80
#define _SEG39COM2              0x80

//==============================================================================


//==============================================================================
//        LCDDATA17 Bits

extern __at(0x0F77) __sfr LCDDATA17;

typedef union
  {
  struct
    {
    unsigned S40C2              : 1;
    unsigned S41C2              : 1;
    unsigned S42C2              : 1;
    unsigned S43C2              : 1;
    unsigned S44C2              : 1;
    unsigned S45C2              : 1;
    unsigned S46C2              : 1;
    unsigned S47C2              : 1;
    };

  struct
    {
    unsigned SEG40COM2          : 1;
    unsigned SEG41COM2          : 1;
    unsigned SEG42COM2          : 1;
    unsigned SEG43COM2          : 1;
    unsigned SEG44COM2          : 1;
    unsigned SEG45COM2          : 1;
    unsigned SEG46COM2          : 1;
    unsigned SEG47COM2          : 1;
    };
  } __LCDDATA17bits_t;

extern __at(0x0F77) volatile __LCDDATA17bits_t LCDDATA17bits;

